// Найдите сумму натуральных чисел кратных 3 или 5 ниже 1000.

int sum = 0;
for (int x = 1; x < 1000; x++)
{
    if (x % 3 == 0 | x % 5 == 0)
    {
        sum = sum + x;
    }
}
Console.WriteLine($"Сумма натуральных чисел кратных 3 или 5 ниже 1000 равна:{sum}");
