// 1.	Вывести квадрат числа

Console.WriteLine("Введите число:");
int b = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"Квадрат числа {b} равен {b*b}");
