// Создание базы данных Персон

using System.Text;
string[] Surnames = { "Смирнов", "Иванов", "Кузнецов", "Соколов", "Попов", "Лебедев", "Козлов", "Новиков", "Морозов", "Петров", "Волков" };
string[] maleNames = { "Прокл", "Артём", "Захар", "Валентин", "Геннадий", "Вадим", "Виталий", "Михаил", "Лаврентий", "Парфен", "Савелий", "Елизар", "Эмиль", "Порфирий", "Марк", "Прохор", "Чеслав", "Касьян", "Антип", "Ефим", "Модест", "Прокофий", "Филимон", "Сергей", "Ираклий", "Дмитрий", "Никанор", "Герман", "Натан", "Наум", "Егор", "Гавриил", "Николай", "Фока", "Адам", "Мечислав", "Кир", "Родион", "Иннокентий", "Осип", "Лука", "Феофан", "Леонид", "Илья", "Давид", "Феликс", "Эрнест", "Иларион", "Виссарион", "Аристарх", "Ярослав", "Ипполит", "Трофим", "Тихон", "Игнатий", "Панкратий", "Онуфрий", "Изяслав", "Лавр", "Алексей", "Арсений", "Феоктист", "Карп", "Владимир", "Юлиан", "Денис", "Андрон", "Варфоломей", "Аркадий", "Казимир", "Аскольд", "Юрий", "Федор", "Артем", "Остап", "Петр", "Эрнст", "Кондратий", "Павел", "Вениамин", "Григорий", "Глеб", "Богдан", "Константин", "Ефрем", "Аким", "Борис", "Кузьма", "Макар", "Матвей", "Никифор", "Рубен", "Владимир", "Иосиф", "Кирилл", "Лукьян", "Владислав", "Валерьян", "Соломон", "Эдуард" };
string[] femaleNames = { "Василиса", "Светлана", "Анфиса", "Яна", "Кристина", "Пелагея", "Анна", "Галина", "Инга", "Наталия", "Ольга", "Раиса", "Оксана", "Валерия", "Наталья", "Кира", "Эвелина", "Евдокия", "Вера", "Нина", "Софья", "Антонина", "Любовь", "Роза", "Ангелина", "Бронислава", "Владлена", "Вероника", "Клара", "Мария", "Алла", "Эльвира", "Ксения", "Ника", "Жанна", "Аза", "Рада", "Елена", "Альбина", "Ирина", "Римма", "Ариадна", "Ярослава", "Диана", "Марианна", "Анисья", "Маргарита", "Фаина", "Агния", "Рената", "Людмила", "Зоя", "Доминика", "Марина", "Инна", "Марта", "Изабелла", "Таисия", "Регина", "Елизавета", "Лариса", "Алина", "Ева", "Берта", "Элеонора", "Дарья", "Стела", "Майя", "Розалия", "Изольда", "Лилия", "Христина", "Татьяна", "Каролина", "Юнона", "Валентина", "Эмилия", "Всеслава", "Янина", "Надежда", "Александра", "Варвара", "Евгения", "Екатерина", "Арина", "Виктория", "Лиана", "Эмма", "Юлия", "Лидия", "Ираида", "Ефросиния", "Нона", "Ефросинья", "Инесса", "Марфа", "Алиса", "Ульяна", "Агафья", "Злата" };
Random r = new Random();
string[] DataBase = new string[10000];

for (int i = 0; i < DataBase.Length; i++)
{
    int sex = r.Next(2);
    int old = r.Next(18, 70);
    if (sex == 0) DataBase[i] = $"{i};{Surnames[r.Next(Surnames.Length)]};{maleNames[r.Next(maleNames.Length)]};{old};Work_{r.Next(30)};{DateTime.Now.Year - old}";
    else DataBase[i] = $"{i};{Surnames[r.Next(Surnames.Length)]}a;{femaleNames[r.Next(femaleNames.Length)]};{old};Work_{r.Next(30)};{DateTime.Now.Year - old}";
}

File.WriteAllLines("db.csv", DataBase, Encoding.Unicode);

// for (int i = 0; i < DataBase.Length; i++)
// {

//     Console.WriteLine(DataBase[i]);
// }

// string[] data = File.ReadAllLines("db.csv"); чтение из файла
// for (int i = 0; i < 100; i++)
// {
//     Console.WriteLine(data[i].Split(';')[2]);
// }