//Задача 17: По двум заданным числам проверять является ли одно квадратом другого

double i = 16;
double k = 4;

bool sqrt1(double i, double k)// проверяем является ли второе число квадратом первого
{
    return i == Math.Pow(k, 2);
}

bool sqrt2(double i, double k)// проверяем является ли первое число квадратом второго
{
    return k == Math.Pow(i, 2);
}

Console.WriteLine($"Первое число {i} является квадратом второго числа {k}? Ответ: {sqrt1(i, k)}");
Console.WriteLine($"Второе число {k} является квадратом первого числа {i}? Ответ: {sqrt2(i, k)}");
